// Lab_03_3.cpp
// Костирко Олександр Андрійович
// Лабораторна робота № 3.3
// Розгалуження, задане графіком функції.
// Варіант 8
 
#include <iostream>
#include <cmath>
 
using namespace std;
 
int main()
{
    double x;    // вхідний аргумент
    double R;    // вхідний параметр (радіус дуги кола; 0 < R < 10)
    double y;    // результат обчислення виразу
    cout << "R = "; cin >> R;
    cout << "x = "; cin >> x;
    if (x <= -8 - R)
        // пряма, паралельна осі 0x
        y = -R;
    else
        if (-8 - R < x && x <= -8 + R)
            // верхня дуга кола радіусу R з центром у точці (-8; -R)
            y = -R + sqrt(R * R - (x + 8) * (x + 8));
        else
            if (-8 + R < x && x <= 2)
                // пряма через точки (-8 + R; -R) та (2; 2)
                y = -R + (2 + R) / (10 - R) * (x + 8 - R);
            else
                if (2 < x && x <= 6)
                    // пряма, що збігається з віссю 0x
                    y = 0;
                else
                    // парабола y = (x - 6)^2
                    y = (x - 6) * (x - 6);
 
    cout << endl;
    cout << "y = " << y << endl;
 
    cin.get();
    cin.get();
    return 0;
}
